package _26_Exceptions;

public class Exceptions {//Исключения - Ошибки возникаюшие при выполнении программы
    //         Случаи возникновения исключений :
    // 1) Из-за неправильных действий пользователя
    // 2) Из-за отстутствия необходимого ресурса(памяти) на диске
    // 3) Из-за потерии соединения с сервером

    //        Виды исключений ( В селениум веб драйвере)
    // 1) NoSuchElement - когда не может найти элемент
    // 2) TimeOutException - когда не успел во время
    // 3) NoAlertException - не нашел такой Алерт (Алерт-всплываюшее окно)
    // 4) ElementNotVisible - элемент невидимый
    // 5) StaleElementReferenceException - Веб элемент по какой-то причине откреплен или изменен.
    // 6) NoSuchWindow - не нашек такое окно
    // 7) atd...





}
